In [3]:
import pandas as pd

cotacoes = {'AAPL':175.23,
            "MSFT": 315.18,
            "GOOGL": 2805.67,
            "AMZN": 3425.52
    
}

In [5]:
series_cot = pd.Series(cotacoes)
series_cot

AAPL      175.23
AMZN     3425.52
GOOGL    2805.67
MSFT      315.18
dtype: float64

In [9]:
series_cot.loc['AAPL']

175.22999999999999

In [14]:
series_cot.iloc[3:4]

MSFT    315.18
dtype: float64

In [19]:
empresas = pd.DataFrame({ "Nome": ["Apple", "Amazon", "Tesla"],
    "Setor": ["Tecnologia", "E-commerce", "Automobilístico"],
    "Receita (bilhões)": [394.3, 469.8, 81.5]
})
empresas

     Nome  Receita (bilhões)            Setor
0   Apple              394.3       Tecnologia
1  Amazon              469.8       E-commerce
2   Tesla               81.5  Automobilístico

In [21]:
empresas['lucro (bilhões)'] = [99.8,33.4,55.5]
empresas

     Nome  Receita (bilhões)            Setor  lucro (bilhões)
0   Apple              394.3       Tecnologia             99.8
1  Amazon              469.8       E-commerce             33.4
2   Tesla               81.5  Automobilístico             55.5

In [36]:
empresas['Setor']
empresas.loc[: 'Setor']
empresas.iloc[:,2:3]

0         Tecnologia
1         E-commerce
2    Automobilístico
Name: Setor, dtype: object

In [41]:
empresas.loc[1]
empresas.loc[1]

Nome                     Amazon
Receita (bilhões)         469.8
Setor                E-commerce
lucro (bilhões)            33.4
Name: 1, dtype: object

In [43]:
empresas.iloc[0:2,:]

     Nome  Receita (bilhões)       Setor  lucro (bilhões)
0   Apple              394.3  Tecnologia             99.8
1  Amazon              469.8  E-commerce             33.4

In [44]:
empresas

     Nome  Receita (bilhões)            Setor  lucro (bilhões)
0   Apple              394.3       Tecnologia             99.8
1  Amazon              469.8       E-commerce             33.4
2   Tesla               81.5  Automobilístico             55.5

In [47]:
empresas.at['Tesla','lucro (bilhões)']
empresas.iat[2, 3]

55.5

In [49]:
empresas.set_index('Nome')

        Receita (bilhões)            Setor  lucro (bilhões)
Nome
Apple               394.3       Tecnologia             99.8
Amazon              469.8       E-commerce             33.4
Tesla                81.5  Automobilístico             55.5

In [59]:
print(empresas.columns)

Index(['Nome', 'Receita (bilhões)', 'Setor', 'lucro (bilhões)'], dtype='object')

In [62]:
receita_total = empresas['Receita (bilhões)'].sum()
empresa_maior_receita = empresas.loc[empresas['Receita (bilhões)'].idxmax(),'Nome']

'Amazon'

In [80]:
Margem_de_Lucro = (empresas['lucro (bilhões)'] / empresas['Receita (bilhões)'])

0    0.253107
1    0.071094
2    0.680982
dtype: float64

In [70]:
empresas_tec = empresas[empresas['Setor']== 'Tecnologia'] 
empresas_tec

    Nome  Receita (bilhões)       Setor  lucro (bilhões)  Margem de Lucro
0  Apple              394.3  Tecnologia             99.8         0.253107

In [71]:
Empresas_lucrativas = (empresas[empresas['lucro (bilhões)']> 50.0])
Empresas_lucrativas

    Nome  Receita (bilhões)            Setor  lucro (bilhões)  Margem de Lucro
0  Apple              394.3       Tecnologia             99.8         0.253107
2  Tesla               81.5  Automobilístico             55.5         0.680982

In [78]:
empresas_tecnologia_poderosa = empresas[(empresas["Setor"] == "Tecnologia") & (empresas["Receita (bilhões)"] > 250)]
empresas_tecnologia_poderosa

    Nome  Receita (bilhões)       Setor  lucro (bilhões)  Margem de Lucro
0  Apple              394.3  Tecnologia             99.8         0.253107